<a href="https://colab.research.google.com/github/nareshchandra06/-my-first-project/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas Exploration**
*  Pandas = Python Data Analysis Library
*  Built on top of NumPy
*  Provides Series (1D) and DataFrame (2D table-like) structures
*  Makes working with structured data (like Excel, CSV, SQL) super easy

**Pandas Series**

  A Pandas Series is one-dimensional labeled array capable of holding data of any type (integer, string, float, Python objects etc.). The axis labels are collectively called indexes. Pandas Series is created by loading the datasets from existing storage which can be a SQL database, a CSV file or an Excel file. It can be created from lists, dictionaries, scalar values, etc.

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd
s = pd.Series([10, 20, 30, 40])
print(s)
print()

##Create series with index identifying each data point as label
obj=pd.Series([4,5,6,7,7], index=["d","e","a","b","c"])
print("Create series with index")
print(obj)

##Labels in index can be used in selecting single value or set of values
print()
print("Labels in index can be used in selecting single value or set of values")
print(obj["d"])
print(obj[["d","e","c"]])
print(obj*2)
obj2=pd.read_csv('/content/drive/MyDrive/insurance.csv')
#print(obj2.head(20))
#print(pd.Series(obj2['sex']).tail(20))

0    10
1    20
2    30
3    40
dtype: int64

Create series with index
d    4
e    5
a    6
b    7
c    7
dtype: int64

Labels in index can be used in selecting single value or set of values
4
d    4
e    5
c    7
dtype: int64
d     8
e    10
a    12
b    14
c    14
dtype: int64
1318      male
1319    female
1320      male
1321      male
1322      male
1323    female
1324      male
1325      male
1326    female
1327      male
1328    female
1329      male
1330    female
1331    female
1332    female
1333      male
1334    female
1335    female
1336    female
1337    female
Name: sex, dtype: object

**Pandas DataFrame**

A Pandas DataFrame is a two-dimensional table-like structure in Python where data is arranged in rows and columns. Itâ€™s one of the most commonly used tools for handling data and makes it easy to organize, analyze and manipulate data. It can store different types of data such as numbers, text and dates across its columns.

In [ ]:
import pandas as pd
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        }
df=pd.DataFrame(data)
print(df)

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [ ]:
##Arrange the columns order
df=pd.DataFrame(data, columns=["Age","Name","Qualification","Address","Scored"])
print(df)
print()
##Print a specific column
print("Print a specific column")
print(df["Name"])
print()
##Print subset of columns
print("Print subset of columns")
print(pd.DataFrame(data, columns=["Name","Age"]))
print()
print("Retreive 2nd row")
print(df.loc[2]) ##Retreive 2nd ros
print(df.iloc[2])
print(df)

##Assign value to empty column
df["Scored"]=60
print(df)

   Age    Name Qualification    Address Scored
0   27     Jai           Msc      Delhi    NaN
1   24  Princi            MA     Kanpur    NaN
2   22  Gaurav           MCA  Allahabad    NaN
3   32    Anuj           Phd    Kannauj    NaN

Print a specific column
0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

Print subset of columns
     Name  Age
0     Jai   27
1  Princi   24
2  Gaurav   22
3    Anuj   32

Retreive 2nd row
Age                     22
Name                Gaurav
Qualification          MCA
Address          Allahabad
Scored                 NaN
Name: 2, dtype: object
Age                     22
Name                Gaurav
Qualification          MCA
Address          Allahabad
Scored                 NaN
Name: 2, dtype: object
   Age    Name Qualification    Address Scored
0   27     Jai           Msc      Delhi    NaN
1   24  Princi            MA     Kanpur    NaN
2   22  Gaurav           MCA  Allahabad    NaN
3   32    Anuj           Phd    Kannauj    NaN
   Age    Name Qualification    Address  Scored
0   27     Jai           Msc      Delhi      60
1   24  Princi            MA     Kanpur      60
2   22  Gaurav           MCA  Allahabad      60
3   32    Anuj           Phd    Kannauj      60

In [ ]:
print()